Revit 2027 API
GradientBackgroundSettings.HorizonColor Property
 The color of the horizon.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color HorizonColor { get; set; }
Public Property HorizonColor As Color
	Get
	Set
public:
property Color^ HorizonColor {
	Color^ get ();
	void set (Color^ value);
}
member HorizonColor : Color with get, set
Property Value
Color
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
GradientBackgroundSettings Class
Autodesk.Revit.DB Namespace